app/Http/Controllers/admin/PricetypeController.php

select * from `pricetypes`
---
    public function index()
    {
        $pricetypes = Pricetype::all();