app/Http/Controllers/admin/ProductstateController.php

select * from `productstates`
---
    public function index()
    {
        $productstates = Productstate::all();

update `productstates` set `name` = 'Mr. Price Paucek DVM1', `productstates`.`updated_at` = '2022-01-12 13:52:19' where `id` = 1
---
    public function update(UpdateProductstateRequest $request, Productstate $productstate)
    {
        $productstate->name = $request->name;
        $productstate->save();

delete from `productstates` where `id` = 1
---
    public function destroy(Productstate $productstate)
    {
        $productstate->delete();